app/controllers/api/v1/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."id" = ? LIMIT ?  [["user_id", 980190962], ["id", 980190962], ["LIMIT", 1]]
---
    def create
        order = current_user.orders.build(order_params)