app/controllers/api/v1/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."id" = ? LIMIT ?  [["user_id", 980190962], ["id", 980190962], ["LIMIT", 1]]
---
    def index
        render json: OrderSerializer.new(current_user.orders).serializable_hash.to_json

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."id" = ? LIMIT ?  [["user_id", 980190962], ["id", 980190962], ["LIMIT", 1]]
---
    def show
        order = current_user.orders.find(params[:id])

INSERT INTO "orders" ("user_id", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 980190962], ["total", 0.0], ["created_at", "2022-06-12 02:53:07.221546"], ["updated_at", "2022-06-12 02:53:07.221546"]]
INSERT INTO "placements" ("order_id", "product_id", "created_at", "updated_at", "quantity") VALUES (?, ?, ?, ?, ?)  [["order_id", 980190963], ["product_id", 980190962], ["created_at", "2022-06-18 18:01:37.821964"], ["updated_at", "2022-06-18 18:01:37.821964"], ["quantity", 2]]
UPDATE "products" SET "quantity" = COALESCE("quantity", 0) - ? WHERE "products"."id" = ?  [["quantity", 2], ["id", 980190962]]
---
    def create
        order = Order.create! user: current_user
        order.build_placements_with_product_ids_and_quantities(order_params[:product_ids_and_quantities])

        if order.save