app/controllers/api/v1/products_controller.rb

    def index
        @products = Product.page(current_page).per(per_page).search(params)
---
SELECT "products".* FROM "products" WHERE (lower(title) LIKE'%tv%')
SELECT COUNT(*) FROM "products"

    def create
        product = current_user.products.build(product_params)
        if product.save
---
INSERT INTO "products" ("title", "price", "published", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "TV Plosmo Philopps"], ["price", 9999.99], ["published", 0], ["user_id", 980190962], ["created_at", "2022-06-06 01:21:33.470191"], ["updated_at", "2022-06-06 01:21:33.470191"]]

    def set_product
        @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE (lower(title) LIKE'%tv%') AND (price >= 50.0) AND (price <= 150.0)