app/controllers/api/v1/tokens_controller.rb

  def create
    @user = User.find_by_email(user_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "one@one.org"], ["LIMIT", 1]]